
# 4. Вывести на экран таблицу из 4 строк: три товара и сумма без использования цикла


milk = 50
egg = 70
burger = 150

summa = milk + egg + burger

print('Молоко', milk)
print('Яйца', egg)
print('Бургер', burger)
print('сумма в корзине', summa)


